perf/test/dictionary-spike.yaml
config:
  environments:
    base:
      target: 'http://localhost:5555/base'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
    cache:
      target: 'http://localhost:5555/cache'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

    replication:
      target: 'http://localhost:5555/replication'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

    rateLimiting:
      target: 'http://localhost:5555/rate-limiting'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  payload:
    path: 'dictionary.csv'
    fields:
      - 'word'
    loadAll: true

  phases:
    - name: start
      duration: 10
      arrivalRate: 3
    - name: spike
      duration: 5
      arrivalRate: 30
    - name: end
      duration: 10
      arrivalRate: 3


scenarios:
  - name: Dictionary
    flow:
      - get:
          url: '/dictionary'
          qs:
            word: '{{ word }}'